# STEP 5: ETL the data from 3NF tables to Facts & Dimension Tables
**IMPORTANT:** The following exercise depends on first having successing completed Exercise 1: Step 4. 

Start by running the code in the cell below to connect to the database. If you are coming back to this exercise, then uncomment and run the first cell to recreate the database. If you recently completed steps 1 through 4, then skip to the second cell.

In [2]:
!PGPASSWORD=student createdb -h 127.0.0.1 -U student pagila
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-schema.sql
!PGPASSWORD=student psql -q -h 127.0.0.1 -U student -d pagila -f Data/pagila-data.sql

 setval
--------
    200
(1 row)

 setval
--------
    605
(1 row)

 setval
--------
     16
(1 row)

 setval
--------
    600
(1 row)

 setval
--------
    109
(1 row)

 setval
--------
    599
(1 row)

 setval
--------
   1000
(1 row)

 setval
--------
   4581
(1 row)

 setval
--------
      6
(1 row)

 setval
--------
  32098
(1 row)

 setval
--------
  16049
(1 row)

 setval
--------
      2
(1 row)

 setval
--------
      2
(1 row)

In [3]:
%load_ext sql

DB_ENDPOINT = "127.0.0.1"
DB = 'pagila'
DB_USER = 'student'
DB_PASSWORD = 'student'
DB_PORT = '5432'

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(DB_USER, DB_PASSWORD, DB_ENDPOINT, DB_PORT, DB)

print(conn_string)
%sql $conn_string

The sql extension is already loaded. To reload it, use:
  %reload_ext sql
postgresql://student:student@127.0.0.1:5432/pagila

'Connected: student@pagila'

### Introducing SQL to SQL ETL
When writing SQL to SQL ETL, you first create a table then use the INSERT and SELECT statements together to populate the table. Here's a simple example.

First, you create a table called test_table.

In [4]:
%%sql
CREATE TABLE test_table
(
  date timestamp,
  revenue  decimal(5,2)
);

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Then you use the INSERT and SELECT statements to populate the table. In this case, the SELECT statement extracts data from the `payment` table and INSERTs it INTO the `test_table`.

In [5]:
%%sql
INSERT INTO test_table (date, revenue)
SELECT payment_date AS date,
       amount AS revenue
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

Then you can use a SELECT statement to take a look at your new table.

In [6]:
%sql SELECT * FROM test_table LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(datetime.datetime(2017, 1, 24, 21, 40, 19, 996577), Decimal('1.99')),
 (datetime.datetime(2017, 1, 25, 15, 16, 50, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 28, 21, 44, 14, 996577), Decimal('6.99')),
 (datetime.datetime(2017, 1, 29, 0, 58, 2, 996577), Decimal('0.99')),
 (datetime.datetime(2017, 1, 29, 8, 10, 6, 996577), Decimal('4.99'))]

If you need to delete the table and start over, use the DROP TABLE command, like below.

In [7]:
%sql DROP TABLE test_table

 * postgresql://student:***@127.0.0.1:5432/pagila
Done.

[]

Great! Now you'll do the same thing below to create the dimension and fact tables for the Star Schema using the data in the 3NF database.

## ETL from 3NF to Star Schema

### 3NF - Entity Relationship Diagram

<img src="./pagila-3nf.png" width="50%"/>

### Star Schema - Entity Relationship Diagram

<img src="pagila-star.png" width="50%"/>

In this section, you'll populate the tables in the Star schema. You'll `extract` data from the normalized database, `transform` it, and `load` it into the new tables. 

To serve as an example, below is the query that populates the `dimDate` table with data from the `payment` table.
* NOTE 1: The EXTRACT function extracts date parts from the payment_date variable.
* NOTE 2: If you get an error that says that the `dimDate` table doesn't exist, then go back to Exercise 1: Step 4 and recreate the tables.

In [9]:
%%sql
INSERT INTO dimDate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date :: DATE, 'yyyyMMDD')::integer) AS date_key,
       date(payment_date)                                           AS date,
       EXTRACT(year FROM payment_date)                              AS year,
       EXTRACT(quarter FROM payment_date)                           AS quarter,
       EXTRACT(month FROM payment_date)                             AS month,
       EXTRACT(day FROM payment_date)                               AS day,
       EXTRACT(week FROM payment_date)                              AS week,
       CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN true ELSE false END AS is_weekend
FROM payment;

 * postgresql://student:***@127.0.0.1:5432/pagila
40 rows affected.

[]

TODO: Now it's your turn. Populate the `dimCustomer` table with data from the `customer`, `address`, `city`, and `country` tables. Use the starter code as a guide.

In [11]:
%%sql
SELECT * FROM address
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (2, '28 MySQL Boulevard', None, 'QLD', 576, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (3, '23 Workhaven Lane', None, 'Alberta', 300, '', '14033335568', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (4, '1411 Lillydale Drive', None, 'QLD', 576, '', '6172235589', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (5, '1913 Hanoi Way', '', 'Nagasaki', 463, '35200', '28303384290', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [13]:
%%sql
INSERT INTO dimCustomer (customer_id, first_name, last_name, email, address, 
                         address2, district, city, country, postal_code, phone, active, 
                         create_date, start_date, end_date)
SELECT  
    c.customer_id,
    c.first_name,
    c.last_name,
    c.email,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    a.phone,
    c.active,
    c.create_date,
    now()         AS start_date,
    now()         AS end_date
FROM customer c
JOIN address a  ON (c.address_id = a.address_id)
JOIN city ci    ON (a.city_id = ci.city_id)
JOIN country co ON (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
599 rows affected.

[]

TODO: Populate the `dimMovie` table with data from the `film` and `language` tables. Use the starter code as a guide.

In [14]:
%sql SELECT * FROM dimMovie;

 * postgresql://student:***@127.0.0.1:5432/pagila
0 rows affected.

[]

In [19]:
%sql SELECT * FROM language LIMIT 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 'English             ', datetime.datetime(2017, 2, 15, 10, 2, 19, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [21]:
%%sql
INSERT INTO dimMovie (
    film_id,
    title,
    description,
    release_year,
    language,
    original_language,
    rental_duration,
    length,
    rating,
    special_features
)
SELECT 
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
    
FROM 
    film f
JOIN 
    language l              
ON
    (f.language_id=l.language_id)
LEFT JOIN
    language orig_lang 
ON 
    (f.original_language_id = orig_lang.language_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
1000 rows affected.

[]

TODO: Populate the `dimStore` table with data from the `store`, `staff`, `address`, `city`, and `country` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [30]:
%sql SELECT * FROM address LIMIT 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, '47 MySakila Drive', None, 'Alberta', 300, '', '', datetime.datetime(2017, 2, 15, 9, 45, 30, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [28]:
%sql SELECT * FROM store LIMIT 1;

 * postgresql://student:***@127.0.0.1:5432/pagila
1 rows affected.

[(1, 1, 1, datetime.datetime(2017, 2, 15, 9, 57, 12, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [35]:
%%sql
INSERT INTO dimStore (
    store_id,
    address,
    address2,
    district,
    city,
    country,
    postal_code,
    manager_first_name,
    manager_last_name,
    start_date,
    end_date
)
SELECT 
    s.store_id,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    st.first_name AS manager_first_name,
    st.last_name AS manager_last_name,
    now() AS start_date,
    now() AS end_date
    
FROM 
    store s
JOIN 
    staff st             
ON
    (s.store_id = st.store_id)
JOIN 
    address a  
ON 
    (s.address_id = a.address_id)
JOIN 
    city ci    
ON
    (a.city_id = ci.city_id)
JOIN
    country co
ON
    (ci.country_id = co.country_id);

 * postgresql://student:***@127.0.0.1:5432/pagila
2 rows affected.

[]

TODO: Populate the `factSales` table with data from the `payment`, `rental`, and `inventory` tables. This time, there's no guide. You should write the query from scratch. Use the previous queries as a reference.

In [37]:
%sql SELECT * FROM factSales;

 * postgresql://student:***@127.0.0.1:5432/pagila
0 rows affected.

[]

In [49]:
%%sql
INSERT INTO factSales (
    date_key,
    customer_key,
    movie_key,
    store_key,
    sales_amount
)
SELECT 
    d.date_key,
    c.customer_key,
    m.movie_key,
    s.store_key,
    p.amount AS sales_amount    
FROM 
    payment p
JOIN 
    rental r
ON
    (p.rental_id = r.rental_id)
JOIN 
    inventory i  
ON 
    (r.inventory_id = i.inventory_id)
JOIN
    dimDate d
ON
    (date(p.payment_date) = d.date)
JOIN
    dimCustomer c
ON
    (p.customer_id = c.customer_id)
JOIN
    dimMovie m
ON
    (i.film_id = m.film_id)
JOIN
    dimStore s
ON
    (i.store_id = s.store_id)

 * postgresql://student:***@127.0.0.1:5432/pagila
16049 rows affected.

[]

In [38]:
%%sql
SELECT
    *
FROM 
    payment p
JOIN 
    rental r
ON
    (p.rental_id = r.rental_id)
JOIN 
    inventory i  
ON 
    (r.inventory_id = i.inventory_id)
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(16050, 269, 2, 7, Decimal('1.99'), datetime.datetime(2017, 1, 24, 21, 40, 19, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 7, datetime.datetime(2005, 5, 24, 23, 11, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 3995, 269, datetime.datetime(2005, 5, 29, 20, 34, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 3995, 870, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16051, 269, 1, 98, Decimal('0.99'), datetime.datetime(2017, 1, 25, 15, 16, 50, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 98, datetime.datetime(2005, 5, 25, 16, 48, 24, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2970, 269, datetime.datetime(2005, 5, 27, 11, 29, 24, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2970, 651, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16052, 269, 2, 678, Decimal('6.99'), datetime.datetime(2017, 1, 28, 21, 44, 14, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 678, datetime.datetime(2005, 5, 28, 23, 15, 48, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 3741, 269, datetime.datetime(2005, 6, 3, 4, 43, 48, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 3741, 818, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16053, 269, 2, 703, Decimal('0.99'), datetime.datetime(2017, 1, 29, 0, 58, 2, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 703, datetime.datetime(2005, 5, 29, 2, 29, 36, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1123, 269, datetime.datetime(2005, 6, 3, 4, 54, 36, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1123, 249, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None))),
 (16054, 269, 1, 750, Decimal('4.99'), datetime.datetime(2017, 1, 29, 8, 10, 6, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 750, datetime.datetime(2005, 5, 29, 9, 41, 40, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 730, 269, datetime.datetime(2005, 5, 30, 13, 31, 40, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 730, 159, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)))]

In [47]:
%%sql
SELECT 
    *  
FROM 
    payment p
JOIN 
    rental r
ON
    (p.rental_id = r.rental_id)
JOIN 
    inventory i  
ON 
    (r.inventory_id = i.inventory_id)
JOIN
    dimDate d
ON
    (date(p.payment_date) = d.date)
JOIN
    dimCustomer c
ON
    (p.customer_id = c.customer_id)
JOIN
    dimMovie m
ON
    (i.film_id = m.film_id)
JOIN
    dimStore s
ON
    (i.store_id = s.store_id)
LIMIT 5;

 * postgresql://student:***@127.0.0.1:5432/pagila
5 rows affected.

[(29004, 1, 2, 9571, Decimal('2.99'), datetime.datetime(2017, 4, 30, 1, 10, 44, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 9571, datetime.datetime(2005, 7, 31, 2, 42, 18, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2219, 1, datetime.datetime(2005, 8, 2, 23, 26, 18, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2219, 480, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20170430, datetime.date(2017, 4, 30), 2017, 2, 4, 30, 17, True, 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2021, 5, 29), datetime.date(2021, 5, 29), 480, 480, 'JEEPERS WEDDING', 'A Astounding Display of a Composer And a Dog who must Kill a Pastry Chef in Soviet Georgia', 2006, 'English', None, 3, 84, 'R', '{Trailers,Commentaries,"Deleted Scenes"}', 1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2021, 5, 29), datetime.date(2021, 5, 29)),
 (29003, 1, 2, 8326, Decimal('2.99'), datetime.datetime(2017, 4, 29, 2, 27, 15, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 8326, datetime.datetime(2005, 7, 29, 3, 58, 49, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 108, 1, datetime.datetime(2005, 8, 1, 5, 16, 49, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 2, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 108, 22, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20170429, datetime.date(2017, 4, 29), 2017, 2, 4, 29, 17, True, 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2021, 5, 29), datetime.date(2021, 5, 29), 23, 22, 'AMISTAD MIDSUMMER', 'A Emotional Character Study of a Dentist And a Crocodile who must Meet a Sumo Wrestler in California', 2006, 'English', None, 6, 85, 'G', '{Commentaries,"Behind the Scenes"}', 1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2021, 5, 29), datetime.date(2021, 5, 29)),
 (29002, 1, 2, 8116, Decimal('0.99'), datetime.datetime(2017, 4, 28, 17, 48, 33, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 8116, datetime.datetime(2005, 7, 28, 19, 20, 7, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 4497, 1, datetime.datetime(2005, 7, 29, 22, 54, 7, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 4497, 982, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20170428, datetime.date(2017, 4, 28), 2017, 2, 4, 28, 17, False, 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2021, 5, 29), datetime.date(2021, 5, 29), 982, 982, 'WOMEN DORADO', 'A Insightful Documentary of a Waitress And a Butler who must Vanquish a Composer in Australia', 2006, 'English', None, 4, 126, 'R', '{"Deleted Scenes","Behind the Scenes"}', 1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2021, 5, 29), datetime.date(2021, 5, 29)),
 (29001, 1, 1, 8074, Decimal('0.99'), datetime.datetime(2017, 4, 28, 16, 2, 5, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 8074, datetime.datetime(2005, 7, 28, 17, 33, 39, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1558, 1, datetime.datetime(2005, 7, 29, 20, 17, 39, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1558, 341, 2, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20170428, datetime.date(2017, 4, 28), 2017, 2, 4, 28, 17, False, 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2021, 5, 29), datetime.date(2021, 5, 29), 341, 341, 'FROST HEAD', 'A Amazing Reflection of a Lumberjack And a Cat who must Discover a Husband in A MySQL Convention', 2006, 'English', None, 5, 82, 'PG', '{Trailers,"Deleted Scenes"}', 2, 2, '28 MySQL Boulevard', None, 'QLD', 'Woodridge', 'Australia', '', 'Jon', 'Stephens', datetime.date(2021, 5, 29), datetime.date(2021, 5, 29)),
 (29000, 1, 2, 8033, Decimal('4.99'), datetime.datetime(2017, 4, 28, 14, 46, 49, 996577, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 8033, datetime.datetime(2005, 7, 28, 16, 18, 23, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 4268, 1, datetime.datetime(2005, 7, 30, 17, 56, 23, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 1, datetime.datetime(2017, 2, 16, 2, 30, 53, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 4268, 929, 1, datetime.datetime(2017, 2, 15, 10, 9, 17, tzinfo=psycopg2.tz.FixedOffsetTimezone(offset=0, name=None)), 20170428, datetime.date(2017, 4, 28), 2017, 2, 4, 28, 17, False, 1, 1, 'MARY', 'SMITH', 'MARY.SMITH@sakilacustomer.org', '1913 Hanoi Way', '', 'Nagasaki', 'Sasebo', 'Japan', '35200', '28303384290', 1, datetime.datetime(2017, 2, 14, 0, 0), datetime.date(2021, 5, 29), datetime.date(2021, 5, 29), 929, 929, 'USUAL UNTOUCHABLES', 'A Touching Display of a Explorer And a Lumberjack who must Fight a Forensic Psychologist in A Shark Tank', 2006, 'English', None, 5, 128, 'PG-13', '{Trailers,Commentaries,"Behind the Scenes"}', 1, 1, '47 MySakila Drive', None, 'Alberta', 'Lethbridge', 'Canada', '', 'Mike', 'Hillyer', datetime.date(2021, 5, 29), datetime.date(2021, 5, 29))]